Repository: ysmaliak/ShipKitNetworking
Catalog: Sources/ShipKitNetworking/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, nl, pl, pt_br, pt_pt

# apiErrorInvalidResponseDescription
source: Unable to process server response
de: Serverantwort konnte nicht verarbeitet werden
es: No se puede procesar la respuesta del servidor
fr: Impossible de traiter la réponse du serveur
it: Impossibile elaborare la risposta del server
nl: Kan serverreactie niet verwerken
pl: Nie można przetworzyć odpowiedzi serwera
pt_br: Não foi possível processar a resposta do servidor
pt_pt: Não foi possível processar a resposta do servidor

# apiErrorHttpErrorDescription
source: A server error occurred
de: Ein Serverfehler ist aufgetreten
es: Se produjo un error del servidor
fr: Une erreur serveur s'est produite
it: Si è verificato un errore del server
nl: Er is een serverfout opgetreden
pl: Wystąpił błąd serwera
pt_br: Ocorreu um erro no servidor
pt_pt: Ocorreu um erro no servidor

# apiErrorInvalidResponseReason
source: The server response contained unexpected data
de: Die Serverantwort enthielt unerwartete Daten
es: La respuesta del servidor contenía datos inesperados
fr: La réponse du serveur contenait des données inattendues
it: La risposta del server conteneva dati inattesi
nl: De serverreactie bevatte onverwachte gegevens
pl: Odpowiedź serwera zawierała nieoczekiwane dane
pt_br: A resposta do servidor continha dados inesperados
pt_pt: A resposta do servidor continha dados inesperados

# apiErrorHttpErrorReason
source: The server could not process the request
de: Der Server konnte die Anfrage nicht verarbeiten
es: El servidor no pudo procesar la solicitud
fr: Le serveur n'a pas pu traiter la requête
it: Il server non ha potuto elaborare la richiesta
nl: De server kon het verzoek niet verwerken
pl: Serwer nie mógł przetworzyć żądania
pt_br: O servidor não pôde processar a solicitação
pt_pt: O servidor não conseguiu processar o pedido

# apiErrorInvalidResponseSuggestion
source: Please try again later
de: Bitte versuchen Sie es später erneut
es: Por favor, inténtelo de nuevo más tarde
fr: Veuillez réessayer plus tard
it: Si prega di riprovare più tardi
nl: Probeer het later opnieuw
pl: Spróbuj ponownie później
pt_br: Por favor, tente novamente mais tarde
pt_pt: Por favor, tente novamente mais tarde

# apiErrorHttpErrorSuggestion
source: Please check your input and try again
de: Bitte überprüfen Sie Ihre Eingabe und versuchen Sie es erneut
es: Por favor, verifique su entrada e inténtelo de nuevo
fr: Veuillez vérifier vos données et réessayer
it: Si prega di verificare i dati inseriti e riprovare
nl: Controleer uw invoer en probeer het opnieuw
pl: Sprawdź wprowadzone dane i spróbuj ponownie
pt_br: Por favor, verifique seus dados e tente novamente
pt_pt: Por favor, verifique os seus dados e tente novamente

# requestErrorInvalidURLDescription
source: Invalid URL
de: Ungültige URL
es: URL no válida
fr: URL invalide
it: URL non valido
nl: Ongeldige URL
pl: Nieprawidłowy URL
pt_br: URL inválida
pt_pt: URL inválido

# requestErrorInvalidParametersDescription
source: Invalid Parameters
de: Ungültige Parameter
es: Parámetros no válidos
fr: Paramètres invalides
it: Parametri non validi
nl: Ongeldige parameters
pl: Nieprawidłowe parametry
pt_br: Parâmetros inválidos
pt_pt: Parâmetros inválidos

# requestErrorMissingBaseURLDescription
source: Missing Base URL
de: Fehlende Basis-URL
es: Falta la URL base
fr: URL de base manquante
it: URL base mancante
nl: Basis-URL ontbreekt
pl: Brak podstawowego URL
pt_br: URL base ausente
pt_pt: URL base em falta

# requestErrorInvalidURLReason
source: The provided URL is invalid
de: Die angegebene URL ist ungültig
es: La URL proporcionada no es válida
fr: L'URL fournie n'est pas valide
it: L'URL fornito non è valido
nl: De opgegeven URL is ongeldig
pl: Podany URL jest nieprawidłowy
pt_br: A URL fornecida é inválida
pt_pt: O URL fornecido é inválido

# requestErrorInvalidParametersReason
source: One or more parameters are invalid
de: Ein oder mehrere Parameter sind ungültig
es: Uno o más parámetros no son válidos
fr: Un ou plusieurs paramètres sont invalides
it: Uno o più parametri non sono validi
nl: Een of meer parameters zijn ongeldig
pl: Jeden lub więcej parametrów jest nieprawidłowych
pt_br: Um ou mais parâmetros são inválidos
pt_pt: Um ou mais parâmetros são inválidos

# requestErrorMissingBaseURLReason
source: The required base URL is not configured
de: Die erforderliche Basis-URL wurde nicht konfiguriert
es: La URL base requerida no está configurada
fr: L'URL de base requise n'est pas configurée
it: L'URL base richiesto non è configurato
nl: De vereiste basis-URL is niet geconfigureerd
pl: Wymagany podstawowy URL nie jest skonfigurowany
pt_br: A URL base necessária não está configurada
pt_pt: O URL base necessário não está configurado

# requestErrorInvalidURLSuggestion
source: Please verify the URL
de: Bitte überprüfen Sie die URL
es: Por favor, verifique la URL
fr: Veuillez vérifier l'URL
it: Si prega di verificare l'URL
nl: Controleer de URL
pl: Sprawdź URL
pt_br: Por favor, verifique a URL
pt_pt: Por favor, verifique o URL

# requestErrorInvalidParametersSuggestion
source: Please check the input values
de: Bitte überprüfen Sie die Eingabewerte
es: Por favor, verifique los valores de entrada
fr: Veuillez vérifier les valeurs saisies
it: Si prega di verificare i valori inseriti
nl: Controleer de ingevoerde waarden
pl: Sprawdź wprowadzone wartości
pt_br: Por favor, verifique os valores inseridos
pt_pt: Por favor, verifique os valores inseridos

# requestErrorMissingBaseURLSuggestion
source: Please ensure the app is properly configured
de: Bitte stellen Sie sicher, dass die App korrekt konfiguriert ist
es: Por favor, asegúrese de que la aplicación esté configurada correctamente
fr: Veuillez vous assurer que l'application est correctement configurée
it: Assicurarsi che l'applicazione sia configurata correttamente
nl: Zorg ervoor dat de app correct is geconfigureerd
pl: Upewnij się, że aplikacja jest prawidłowo skonfigurowana
pt_br: Certifique-se de que o aplicativo esteja configurado corretamente
pt_pt: Certifique-se de que a aplicação está configurada corretamente
